package lesson14.hometask14;

/*
Создать перечисление, содержащее размеры одежды (XXS, XS, S, M, L).
Также перечисление должно содержать числовое значение euroSize(32, 34, 36, 38, 40), соответствующее каждому размеру.
Перечисление содержит description и метод getDescription.
description будет “Детский размер” для XXS и "Взрослый размер" для остальных.
Создать конструктор, принимающий на вход euroSize.
Создать конструктор, принимающий на вход description и euroSize.
На консоль выводится список всех резмеров: XXS, XS, S, M, L.
Пользователь вводит размер, например, XS,
программа вывод его порядковый номер ordinal(), euroSize и description.
 */
public class ClothSizes {
}
